#초성#
CHO_VS = {"ᅡ", "ᅣ", "ᅥ", "ᅧ", "ᅵ", "ᆝ"}
CHO_VD = {"ᅢ", "ᅤ", "ᅦ", "ᅨ", "ᆘ", "ᆙ", "ᆥ", "ퟄ", "ힿ", "ퟀ", "ힾ"}

CHO_OO = {"ᅩ", "ᅭ", "ᅳ"}
CHO_OU = {"ᅮ", "ᅲ"}
CHO_OD = {"ᆂ", "ᆃ", "ᆇ", "ᆍ", "ᆓ", "ᆕ", "ᆠ", "ힼ", "ힸ", "ힱ"}
CHO_OS = {"ᆖ"}
CHO_OA = {"ᆞ", "ᆢ"}

CHO_NWA = {"ᅶ", "ᅸ", "ᅹ", "ᆣ"}
CHO_NWB = {"ᅫ", "ᆀ", "ᆁ", "ᆅ", "ᆧ", "ퟆ", "ힳ", "ힻ", "ힽ"}
CHO_NWC = {"ᅬ", "ᅺ", "ᅼ", "ᅽ", "ᅿ", "ᆈ", "ᅴ", "ᆗ", "ᆚ", "ᆜ", "ힺ", "ퟁ", "ퟂ", "ힰ", "ힴ"}
CHO_NWD = {"ᅯ", "ᅱ", "ᅾ", "ᆋ", "ᆏ", "ᆑ", "ᆔ", "ᆛ", "ᆟ", "ᆡ", "ퟃ", "ힵ"}
CHO_NWE = {"ᅰ", "ᆊ", "ᆌ", "ᆐ", "ᆒ", "ힶ", "ힷ"}
CHO_NWF = {"ᅻ"}
CHO_NWG = {"ᅪ", "ᆄ", "ᆆ", "ᆦ", "ힲ", "ퟅ", "ힹ"}
CHO_NWH = {"ᅷ", "ᆉ", "ᆎ", "ᆤ"}

#받침 있을 때
CHO_YWA = {"ᅪ", "ᅫ", "ᅯ", "ᅶ", "ᅷ", "ᅸ", "ᅹ", "ᅿ", "ᆣ", "ᆤ", "ힹ", "ퟅ"}
CHO_YWB = {"ᅰ", "ᆀ", "ᆁ", "ᆄ", "ᆅ", "ᆆ", "ᆉ", "ᆊ", "ᆌ", "ᆎ", "ᆏ", "ᆐ", "ᆑ", "ᆒ", "ᆟ", "ᆦ", "ᆧ", "ힳ", "ퟆ", "ힲ", "ힴ", "ힵ", "ힶ", "ힷ", "ힽ", "ힻ", "ힺ"}
CHO_YWC = {"ᅬ", "ᅱ", "ᅴ", "ᅺ", "ᅻ", "ᅼ", "ᅽ", "ᅾ", "ᆈ", "ᆔ", "ᆚ", "ᆛ", "ᆜ", "ᆡ", "ퟂ", "ퟃ", "ퟁ"}
CHO_YWD = {"ᆋ", "ᆗ"}

CHO_N_GROUP = {
    "NVS": CHO_VS,
    "NVD": CHO_VD,
    
    "NOO": CHO_OO,
    "NOU": CHO_OU,
    "NOD": CHO_OD,
    "NOS": CHO_OS,
    "NOA": CHO_OA,

    "NWA": CHO_NWA,
    "NWB": CHO_NWB,
    "NWC": CHO_NWC,
    "NWD": CHO_NWD,
    "NWE": CHO_NWE,
    "NWF": CHO_NWF,
    "NWG": CHO_NWG,
    "NWH": CHO_NWH
}

CHO_Y_GROUP = {
    "YVS": CHO_VS,
    "YVD": CHO_VD,
    
    "YOO": CHO_OO,
    "YOU": CHO_OU,
    "YOD": CHO_OD,
    "YOS": CHO_OS,
    "YOA": CHO_OA,

    "YWA": CHO_YWA,
    "YWB": CHO_YWB,
    "YWC": CHO_YWC,
    "YWD": CHO_YWD
}



#중성#
JUNG_D = {"ᄢ", "ᄣ", "ᄤ", "ᄥ", "ᄦ", "ᄪ", "ᄺ", "ᅋ", "ᅖ", "ꥥ", "ꥧ", "ꥪ", "ꥲ", "ꥵ", "ꥸ", "ꥺ"}
JUNG_S = {"ᄀ", "ᄁ", "ᄂ", "ᄃ", "ᄄ", "ᄅ", "ᄆ", "ᄇ", "ᄈ", "ᄉ", "ᄊ", "ᄋ", "ᄌ", "ᄍ", "ᄎ", "ᄏ", "ᄐ", "ᄑ", "ᄒ", "ᄓ", "ᄔ", "ᄕ", "ᄖ", "ᄗ", "ᄘ", "ᄙ", "ᄚ", "ᄛ", "ᄜ", "ᄝ", "ᄞ", "ᄟ", "ᄠ", "ᄡ", "ᄢ", "ᄣ", "ᄤ", "ᄥ", "ᄦ", "ᄧ", "ᄨ", "ᄩ", "ᄪ", "ᄫ", "ᄬ", "ᄭ", "ᄮ", "ᄯ", "ᄰ", "ᄱ", "ᄲ", "ᄳ", "ᄴ", "ᄵ", "ᄶ", "ᄷ", "ᄸ", "ᄹ", "ᄺ", "ᄻ", "ᄼ", "ᄽ", "ᄾ", "ᄿ", "ᅀ", "ᅁ", "ᅂ", "ᅃ", "ᅄ", "ᅅ", "ᅆ", "ᅇ", "ᅈ", "ᅉ", "ᅊ", "ᅋ", "ᅌ", "ᅍ", "ᅎ", "ᅏ", "ᅐ", "ᅑ", "ᅒ", "ᅓ", "ᅔ", "ᅕ", "ᅖ", "ᅗ", "ᅘ", "ᅙ", "ᅚ", "ᅛ", "ᅜ", "ᅝ", "ᅞ", "ᅟ","ꥠ", "ꥡ", "ꥢ", "ꥣ", "ꥤ", "ꥦ", "ꥨ", "ꥩ", "ꥫ", "ꥬ", "ꥭ", "ꥮ", "ꥯ", "ꥰ", "ꥱ", "ꥳ", "ꥴ", "ꥶ", "ꥷ", "ꥹ", "ꥻ", "ꥼ"}

JUNG_N_GROUP = {
    "ND": JUNG_D,
    "NS": JUNG_S
}

JUNG_Y_GROUP = {
    "YD": JUNG_D,
    "YS": JUNG_S
}



#종성#
#초성에 의한 중성 너비 변경에 따른 종성의 경우
JONG_DD = {"ᅥ", "ᅦ", "ᅧ", "ᅨ", "ᅫ", "ᅰ", "ᅵ", "ᆊ", "ᆌ", "ᆑ", "ᆘ", "ᆙ", "ᆧ", "ퟄ"}

JONG_VS = {"ᅡ", "ᅣ", "ᅥ", "ᅧ", "ᅵ", "ᆝ", "ᅩ", "ᅭ", "ᅳ", "ᅮ", "ᅲ", "ᅪ", "ᅫ", "ᅯ"}
JONG_VD = {"ᅢ", "ᅤ", "ᅦ", "ᅨ", "ᆘ", "ᆙ", "ᆥ", "ᅬ", "ᅱ", "ᅴ", "ퟄ", "ᅶ", "ᅷ", "ᅸ", "ᅹ", "ᅿ", "ᆣ", "ᆤ", "ᅺ", "ᅻ", "ᅼ", "ᅽ", "ᅾ", "ᆈ", "ᆔ", "ᆚ", "ᆛ", "ᆜ", "ᆦ", "ᆑ", "ᆎ", "ᆏ", "ᆆ", "ᆉ", "ᆄ", "ힰ", "ퟂ", "ퟃ", "ퟁ", "ힹ", "ힲ", "ힴ", "ힵ", "ힺ"}
JONG_L = {"ᆂ", "ᆃ", "ᆇ", "ᆍ", "ᆓ", "ᆕ", "ᆠ", "ᆋ", "ᆗ", "ᆖ", "ᆞ", "ᆢ", "ힱ", "ퟅ", "ퟆ", "ힸ", "ힼ"}
JONG_H = {"ᅰ", "ᆀ", "ᆁ", "ᆅ", "ᆊ", "ᆌ", "ᆐ", "ᆒ", "ᆧ", "ힳ", "ힶ", "ힷ", "ힽ", "ힻ", "ᆡ", "ᆟ"}

JONG_GROUP = {
    "VS": JONG_VS,
    "VD": JONG_VD,
    "L": JONG_L,
    "H": JONG_H
}
